
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>输入 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="输出.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="输入.html">
            
                <a href="输入.html">
            
                    
                    输入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="输出.html">
            
                <a href="输出.html">
            
                    
                    输出
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >输入</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="markdown&#x7B14;&#x8BB0;&#x5DE5;&#x4F5C;&#x6D41;">Markdown&#x7B14;&#x8BB0;&#x5DE5;&#x4F5C;&#x6D41;</h1>
<p>&#x4FD7;&#x8BDD;&#x8BF4;&#x7684;&#x597D;&#xFF0C;&#x201C;&#x5DE5;&#x6B32;&#x5584;&#x5176;&#x4E8B;&#xFF0C;&#x5FC5;&#x5148;&#x5229;&#x5176;&#x5668;&#x201D;&#xFF0C;&#x4F18;&#x79C0;&#x7684;&#x6548;&#x7387;&#x5DE5;&#x5177;&#x4E0D;&#x4EC5;&#x80FD;&#x663E;&#x8457;&#x63D0;&#x9AD8;&#x5B66;&#x4E60;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#xFF0C;&#x800C;&#x4E14;&#x8D8A;&#x6765;&#x8D8A;&#x6210;&#x4E3A;&#x521B;&#x4F5C;&#x8005;&#x4E0D;&#x65AD;&#x521B;&#x4F5C;&#x8F93;&#x51FA;&#x7684;&#x52A8;&#x529B;&#x3002;&#x4ECE;&#x5927;&#x4E00;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x5404;&#x5F0F;&#x5404;&#x6837;&#x7684;&#x6548;&#x7387;&#x5DE5;&#x5177;&#xFF0C;&#x5230;&#x73B0;&#x5728;&#x4E5F;&#x8BD5;&#x7528;&#x4E86;&#x4E0A;&#x767E;&#x79CD;&#xFF0C;&#x4E5F;&#x521D;&#x6B65;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x4E9B;&#x81EA;&#x5DF1;workflow&#xFF0C;&#x8986;&#x76D6;&#x6587;&#x4EF6;&#x7BA1;&#x7406;&#xFF0C;markdown&#x7B14;&#x8BB0;&#xFF0C;&#x6587;&#x732E;&#x9605;&#x8BFB;&#x7B49;&#x7B49;&#xFF0C;&#x6240;&#x4EE5;&#x60F3;&#x4E0E;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x4EA4;&#x6D41; &#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x77E5;&#x8BC6;&#x8F93;&#x5165;&#x662F;&#x6211;&#x76EE;&#x524D;&#x5B66;&#x4E60;&#x5DE5;&#x4F5C;&#x7684;&#x4E3B;&#x4F53;&#xFF0C;&#x6240;&#x4EE5;&#x4F5C;&#x4E3A;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x7684;&#x7B2C;&#x4E00;&#x7BC7;&#xFF0C;&#x6211;&#x60F3;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;markdown&#x7B14;&#x8BB0;&#x5DE5;&#x4F5C;&#x6D41;&#x3002;</p>
<p>&#x6211;&#x7684;&#x7B14;&#x8BB0;&#x5DE5;&#x4F5C;&#x6D41;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;</p>
<ol>
<li>&#x641C;&#x96C6; Collection</li>
<li>&#x8BB0;&#x5F55; Markdown</li>
<li>&#x540C;&#x6B65; Sync</li>
</ol>
<h2 id="1-&#x641C;&#x96C6;-collection">1. &#x641C;&#x96C6; Collection</h2>
<p>&#x5F52;&#x529F;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x4FE1;&#x606F;&#x7206;&#x70B8;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x641C;&#x7D22;&#x65B9;&#x5F0F;&#x4ECE;<strong>&#x7EB8;&#x672C;&#x641C;&#x7D22;</strong>&#x9010;&#x6E10;&#x8F6C;&#x6362;&#x4E3A;<strong>&#x7EBF;&#x4E0A;&#x641C;&#x7D22;</strong>&#xFF0C;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x4E5F;&#x6210;&#x6307;&#x6570;&#x578B;&#x589E;&#x957F;&#xFF0C;&#x5982;&#x4F55;&#x4ECE;&#x5E9E;&#x5927;&#x3001;&#x6742;&#x4E71;&#x7684;&#x8D44;&#x6599;&#x4E2D;&#x8FC7;&#x6EE4;&#x51FA;&#x6211;&#x4EEC;&#x6240;&#x9700;&#x8981;&#x7684;&#x5185;&#x5BB9;&#x5C31;&#x663E;&#x5F97;&#x5C24;&#x4E3A;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8D44;&#x6599;&#x7684;&#x641C;&#x96C6;&#x5DE5;&#x4F5C;&#x6D41;&#xFF0C;&#x6211;&#x4E3B;&#x8981;&#x91C7;&#x7528; flomo + Evernote</p>
<h3 id="flomo">flomo</h3>
<blockquote>
<p>flomo = flow + memo</p>
</blockquote>
<p>flomo&#x662F;<em>flow</em>&#x548C;<em>memo</em>&#x7684;&#x5408;&#x4F53;&#xFF0C;&#x987E;&#x540D;&#x601D;&#x4E49;&#x5C31;&#x662F;&#x8BB0;&#x5F55;&#x4F60;&#x7684;&#x601D;&#x60F3;&#x5DDD;&#x6D41;&#xFF0C;&#x867D;&#x7136;&#x6709;&#x5927;&#x628A;&#x4EBA;&#x63A8;&#x8350;&#x5C06;flomo&#x4F5C;&#x4E3A;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x628A;&#x4ED6;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#x641C;&#x96C6;&#x5DE5;&#x5177;&#xFF0C;&#x4E0E;&#x4F20;&#x7EDF;&#x7684;&#x7B14;&#x8BB0;&#x8BB0;&#x5F55;&#x8F6F;&#x4EF6;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x7279;&#x8272;&#xFF1A;</p>
<ol>
<li>&#x5361;&#x7247;&#x5448;&#x73B0;&#xFF0C;&#x6807;&#x7B7E;&#x7BA1;&#x7406;
flomo&#x98A0;&#x8986;&#x4E86;&#x4F20;&#x7EDF;&#x7684;&#x6587;&#x672C;&#x5448;&#x73B0;&#x548C;&#x6587;&#x4EF6;&#x5939;&#x7BA1;&#x7406;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x800C;&#x662F;&#x91C7;&#x7528;&#x7C7B;&#x4F3C;&#x4E8E;&#x77E5;&#x8BC6;&#x5361;&#x7247;&#x7684;&#x8BB0;&#x5F55;&#x548C;&#x5448;&#x73B0;&#x5F62;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x7701;&#x53BB;&#x4E86;&#x6392;&#x7248;&#x5206;&#x6BB5;&#x7B49;&#x7E41;&#x5197;&#x6B65;&#x9AA4;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x4E13;&#x6CE8;&#x8BB0;&#x5F55;&#x60F3;&#x6CD5;&#x3002;</li>
<li>&#x591A;&#x7AEF;&#x540C;&#x6B65;&#xFF08;&#x514D;&#x8D39;&#xFF09;
flomo&#x652F;&#x6301;&#x684C;&#x9762;&#x7AEF;&#xFF0C;&#x79FB;&#x52A8;&#x7AEF;&#xFF0C;Web&#x7AEF;&#x540C;&#x6B65;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0E;&#x5FAE;&#x4FE1;&#x7AEF;&#x53E3;&#x7ED1;&#x5B9A;&#xFF0C;&#x53EA;&#x9700;&#x5728;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x4E2D;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x5373;&#x53EF;&#x8FDB;&#x884C;&#x8BB0;&#x5F55;&#xFF0C;&#x7B80;&#x76F4;&#x662F;&#x65E5;&#x8BB0;&#x515A;&#x798F;&#x97F3;&#xFF01;</li>
<li>&#x754C;&#x9762;&#x7F8E;&#x89C2;&#xFF0C;&#x6BCF;&#x65E5;&#x56DE;&#x987E;
flomo&#x7684;&#x754C;&#x9762;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x56FD;&#x4EA7;&#x7B14;&#x8BB0;&#x8F6F;&#x4EF6;&#x7684;&#x5929;&#x82B1;&#x677F;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x914D;&#x5408;&#x7C7B;&#x4F3C;&#x4E8E;GitHub&#x7684;&#x8D21;&#x732E;&#x56FE;&#x8FDB;&#x884C;&#x7B14;&#x8BB0;&#x7684;&#x91CF;&#x5316;&#xFF0C;&#x9010;&#x6E10;&#x57F9;&#x517B;&#x6BCF;&#x65E5;&#x8BB0;&#x5F55;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x6BCF;&#x65E5;&#x56DE;&#x987E;&#x548C;&#x968F;&#x673A;&#x6F2B;&#x6B65;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x5236;&#x5B9A;&#x89C4;&#x5219;&#x63A8;&#x9001;&#x5230;&#x5FAE;&#x4FE1;&#xFF0C;&#x5BF9;&#x7279;&#x5B9A;&#x6807;&#x7B7E;&#x6216;&#x8005;&#x5173;&#x952E;&#x8BCD;&#x8FDB;&#x884C;&#x968F;&#x673A;&#x56DE;&#x987E;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x914D;&#x5408;widget&#x56DE;&#x987E;&#x3002;</li>
</ol>
<p><img src="https://heinrich-1304907654.cos.ap-beijing.myqcloud.com/uPic/CleanShot%202022-01-21%20at%2017.50.23%402x.png" alt="CleanShot2022-01-21at17.50.23@2x"></p>
<p>&#x5230;&#x73B0;&#x5728;flomo&#x5DF2;&#x7ECF;&#x7528;&#x4E86;336&#x5929;&#x4E86;&#xFF0C;&#x4E2D;&#x95F4;&#x5F03;&#x7528;&#x8FC7;&#x51E0;&#x6B21;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x540E;&#x8FD8;&#x662F;&#x201C;&#x4E56;&#x4E56;&#x201D;&#x56DE;&#x5F52;&#xFF08;&#x6BD5;&#x7ADF;&#x4E70;&#x4E86;pro&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x53EA;&#x7528;flomo&#x8BB0;&#x5F55;&#x7A81;&#x7136;&#x95EA;&#x8FC7;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5728;&#x624B;&#x673A;&#x9605;&#x8BFB;&#x7F51;&#x9875;&#x6216;&#x8005;&#x9605;&#x8BFB;&#x7EB8;&#x672C;&#x8FC7;&#x7A0B;&#x4E2D;&#x6458;&#x5F55;&#x7684;&#x6587;&#x5B57;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x7528;&#x4ED6;&#x8BB0;&#x65E5;&#x8BB0;&#xFF0C;&#x5BF9;&#x4E8E;&#x201C;&#x6B63;&#x7ECF;&#x201D;&#x7684;&#x8D44;&#x6599;&#x6536;&#x96C6;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x4E0D;&#x9002;&#x5E94;&#x7528;flomo&#xFF0C;&#x6211;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x7528;&#x4E86;&#x5F88;&#x591A;&#x5E74;&#x7684;Evernote&#x3002;</p>
<h3 id="evernote">Evernote</h3>
<blockquote>
<p>&#x515C;&#x515C;&#x8F6C;&#x8F6C;&#xFF0C;&#x8FD8;&#x662F;&#x5F97;&#x9009;&#x8FD9;&#x53EA;&#x8C61;</p>
</blockquote>
<p>Evernote&#xFF0C;&#x8FDC;&#x53E4;&#x7EA7;&#x7B14;&#x8BB0;&#x8F6F;&#x4EF6;&#xFF0C;&#x5728;&#x56FD;&#x5185;&#x53EB;&#x5370;&#x8C61;&#x7B14;&#x8BB0;&#xFF0C;&#x4E4B;&#x524D;&#x662F;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x73B0;&#x5728;Evernote&#x548C;&#x5370;&#x8C61;&#x7B14;&#x8BB0;&#x5DF2;&#x7ECF;&#x5206;&#x5BB6;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x8D26;&#x53F7;&#x4E0D;&#x4E92;&#x901A;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6CE8;&#x518C;&#x65F6;&#x8BF7;&#x6309;&#x9700;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x53BB;&#x5E74;&#x5C1D;&#x8BD5;&#x8FC7;&#x5C06;&#x7B14;&#x8BB0;&#x4E3B;&#x529B;&#x6362;&#x4E3A;&#x53BB;&#x5E74;&#x7F51;&#x7EA2;&#x8F6F;&#x4EF6;Notion&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x540E;&#x515C;&#x515C;&#x8F6C;&#x8F6C;&#x8FD8;&#x662F;&#x56DE;&#x5230;&#x4E86;Evernote&#xFF0C;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x539F;&#x56E0;&#xFF1A;</p>
<ol>
<li>&#x8D85;&#x8D8A;&#x7B80;&#x5355;&#x7684;&#x6587;&#x5B57;&#x7B14;&#x8BB0; 
Evernote&#x652F;&#x6301;&#x5F85;&#x529E;&#x4E8B;&#x9879;&#x3001;&#x65E5;&#x5386;&#x3001;&#x8868;&#x683C;&#x3001;&#x9644;&#x4EF6;&#x3001;&#x56FE;&#x7247;&#x3001;&#x4EE3;&#x7801;&#x7B49;&#x7B49;&#x7684;&#x690D;&#x5165;&#xFF0C;&#x867D;&#x7136;&#x4E0E;&#x76EE;&#x524D;&#x65B0;&#x7684;&#x7B14;&#x8BB0;&#x8F6F;&#x4EF6;&#x76F8;&#x6BD4;&#x7565;&#x5C11;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x5355;&#x7EAF;&#x7684;&#x7B14;&#x8BB0;&#x8F6F;&#x4EF6;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x6211;&#x6700;&#x559C;&#x6B22;&#x529F;&#x80FD;&#x5C31;&#x662F;PDF&#x7684;&#x690D;&#x5165;&#xFF0C;&#x53EF;&#x4EE5;&#x4EE5;&#x9644;&#x4EF6;&#x6216;&#x8005;&#x5355;&#x9875;&#x7684;&#x5F62;&#x5F0F;&#x8FDB;&#x884C;&#x663E;&#x793A;&#xFF0C;&#x53EF;&#x8C13;&#x662F;&#x6587;&#x732E;&#x9605;&#x8BFB;&#x795E;&#x5668;&#x3002;</li>
</ol>
<p><img src="https://heinrich-1304907654.cos.ap-beijing.myqcloud.com/uPic/CleanShot%202022-01-21%20at%2018.48.16%402x.png" alt="CleanShot2022-01-21at18.48.16@2x"></p>
<ol>
<li><p>&#x591A;&#x7AEF;&#x540C;&#x6B65;&#xFF0C;&#x94FE;&#x63A5;&#x5171;&#x4EAB;
Evernote&#x7684;&#x591A;&#x7AEF;&#x540C;&#x6B65;&#x662F;&#x6211;&#x7528;&#x8FC7;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x4E0D;&#x4EC5;&#x901F;&#x5EA6;&#x5FEB;&#xFF08;Evernote&#x9700;&#x8981;&#x4E0A;&#x7F51;&#x5DE5;&#x5177;&#xFF09;&#xFF0C;&#x800C;&#x4E14;&#x5404;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x7684;app&#x90FD;&#x5F62;&#x5F0F;&#x7B80;&#x6D01;&#x7EDF;&#x4E00;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x4E0A;&#x624B;&#x3002;Evernote&#x652F;&#x6301;&#x94FE;&#x63A5;&#x5206;&#x4EAB;&#xFF0C;&#x522B;&#x4EBA;&#x53EF;&#x4EE5;&#x975E;&#x767B;&#x5F55;&#x6761;&#x4EF6;&#x4E0B;&#x8FDB;&#x884C;&#x67E5;&#x770B;&#x548C;&#x7F16;&#x8F91;&#xFF0C;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x5728;&#x5370;&#x8C61;&#x7B14;&#x8BB0;&#x4E2D;&#x7981;&#x7528;&#x4E86;&#x3002;</p>
</li>
<li><p>&#x7F51;&#x9875;&#x526A;&#x85CF;&#x795E;&#x5668;
&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x771F;&#x7684;&#x662F;&#x5439;&#x7206;&#xFF01;Evernote&#x662F;&#x6211;&#x7528;&#x8FC7;&#x6700;&#x65B9;&#x4FBF;&#x7684;&#x526A;&#x85CF;&#x8F6F;&#x4EF6;&#xFF0C;&#x53EA;&#x8981;&#x642D;&#x914D;Chrome&#x7684;&#x63D2;&#x4EF6;Evernote Web Clipper&#xFF0C;&#x8F7B;&#x8F7B;&#x4E00;&#x70B9;&#x7F51;&#x9875;&#x5373;&#x53EF;&#x4FDD;&#x5B58;&#x81F3;Evernote&#xFF0C;&#x65B9;&#x4FBF;&#x65E5;&#x540E;&#x67E5;&#x770B;&#xFF0C;&#x7701;&#x53BB;&#x4E86;&#x7F51;&#x9875;&#x6536;&#x85CF;&#x6574;&#x7406;&#x7684;&#x70E6;&#x607C;&#x3002;</p>
</li>
</ol>
<p><img src="https://heinrich-1304907654.cos.ap-beijing.myqcloud.com/uPic/CleanShot%202022-01-21%20at%2019.41.28%402x.png" alt="CleanShot2022-01-21at19.41.28@2x"></p>
<p>&#x5F53;&#x7136;Evernote&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x8DB3;&#xFF0C;&#x6BD4;&#x5982;&#x4F20;&#x7EDF;&#x7684;&#x6587;&#x4EF6;&#x5939;&#x548C;&#x6807;&#x7B7E;&#x7B14;&#x8BB0;&#x5F62;&#x5F0F;&#x4E0D;&#x65B9;&#x4FBF;&#x8FDB;&#x884C;&#x6574;&#x7406;&#xFF0C;&#x4E0D;&#x652F;&#x6301;markdown&#x8BED;&#x6CD5;&#xFF08;&#x4E00;&#x4EBA;&#x8840;&#x4E66;&#x6C42;&#x8D76;&#x7D27;&#x652F;&#x6301;markdown&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x8FD8;&#x662F;&#x6210;&#x4E3A;&#x6211;&#x7684;&#x4E3B;&#x529B;&#x7B14;&#x8BB0;&#x8F6F;&#x4EF6;&#xFF0C;&#x5E76;&#x6210;&#x529F;&#x8BA9;&#x6211;&#x52A0;&#x5165;<strong>Evernote Personal</strong>&#x8BA2;&#x9605;&#x3002;Evernote&#x7684;&#x8BA2;&#x9605;&#x8981;&#x6BD4;&#x5370;&#x8C61;&#x7B14;&#x8BB0;&#x8D35;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x662F;Evernote&#x6709;&#x5730;&#x57DF;&#x5DEE;&#x5F02; &#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x8F6C;&#x533A;&#x8D8A;&#x5357;&#x533A;&#x652F;&#x4ED8;&#xFF0C;&#x4E00;&#x5E74;&#x53EA;&#x8981;77&#x7C73;&#xFF08;275000&#x8D8A;&#x5357;&#x76FE;&#xFF09;&#xFF0C;&#x800C;&#x7F8E;&#x533A;&#x662F;443&#x7C73;&#xFF08;69.9&#x7F8E;&#x5143;&#xFF09;&#xFF0C;&#x7701;&#x4E86;&#x597D;&#x591A;&#x3002;</p>
<p><img src="https://heinrich-1304907654.cos.ap-beijing.myqcloud.com/uPic/CleanShot%202022-01-21%20at%2018.48.16%402x.png" alt="CleanShot2022-01-21at19.48.36@2x"></p>
<h2 id="2-&#x8BB0;&#x5F55;-markdown">2. &#x8BB0;&#x5F55; Markdown</h2>
<p>Markdown&#x662F;&#x4E00;&#x79CD;&#x8F7B;&#x91CF;&#x7EA7;&#x6807;&#x8BB0;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x4EBA;&#x4EEC;&#x4F7F;&#x7528;&#x6613;&#x8BFB;&#x6613;&#x5199;&#x7684;&#x7EAF;&#x6587;&#x672C;&#x683C;&#x5F0F;&#x7F16;&#x5199;&#x6587;&#x6863;&#xFF0C;&#x7136;&#x540E;&#x8F6C;&#x6362;&#x6210;&#x6709;&#x6548;&#x7684;XHTML&#x6216;HTML&#x6587;&#x6863;&#xFF0C;markdown&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x5F53;&#x524D;&#x4E92;&#x8054;&#x7F51;&#x6700;&#x6D41;&#x884C;&#x7684;&#x5199;&#x4F5C;&#x8BED;&#x8A00;&#x3002;</p>
<p>Markdown&#x5341;&#x5206;&#x6613;&#x5B66;&#xFF0C;&#x4E94;&#x5206;&#x949F;&#x5185;&#x5373;&#x53EF;&#x638C;&#x63E1;&#x57FA;&#x672C;&#x8BED;&#x6CD5;&#xFF0C;&#x800C;&#x4E14;&#x7531;&#x4E8E;markdown&#x662F;&#x7EAF;&#x6587;&#x672C;&#x5199;&#x4F5C;&#xFF0C;&#x7701;&#x53BB;&#x4E86;&#x6392;&#x7248;&#x7684;&#x70E6;&#x607C;&#xFF0C;&#x662F;&#x6C89;&#x6D78;&#x5F0F;&#x5199;&#x4F5C;&#x7684;&#x7EDD;&#x4F73;&#x5DE5;&#x5177;&#x3002;</p>
<p><img src="https://heinrich-1304907654.cos.ap-beijing.myqcloud.com/uPic/76Q4lK.jpg" alt="76Q4lK"></p>
<p>&#x76EE;&#x524D;&#xFF0C;&#x5E02;&#x9762;&#x4E0A;&#x6709;&#x5927;&#x91CF;markdown&#x7684;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x5305;&#x62EC;&#x514D;&#x8D39;&#x7684;iA Writer&#x3001; Draft&#x3001;Bear&#x3001;VScode&#x7B49;&#x7B49;&#xFF0C;&#x8FD8;&#x6709;&#x9700;&#x8981;&#x4ED8;&#x8D39;&#x7684;Typora&#xFF08;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x514D;&#x8D39;&#xFF09;&#x548C;Ulysses&#x3002;&#x6211;&#x6700;&#x521D;&#x4F7F;&#x7528;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x8FD9;&#x4E9B;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x7B80;&#x4E66;&#x7801;&#x5B57;&#x754C;&#x9762;&#xFF0C;&#x5F53;&#x65F6;&#x4E00;&#x7528;&#x5C31;&#x9A6C;&#x4E0A;&#x7231;&#x4E0A;&#x4E86;md&#xFF0C;&#x7531;&#x4E8E;Web&#x7AEF;&#x4E0D;&#x7A33;&#x5B9A;&#xFF0C;&#x6240;&#x4EE5;&#x5F00;&#x59CB;&#x627E;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;markdown&#x7F16;&#x8F91;&#x5668;&#x3002;</p>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x7528;&#x8FC7;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x4EE5;&#x53CA;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x7684;&#x539F;&#x56E0;&#xFF1A;</p>
<blockquote>
<p>VS Code - &#x6DF1;&#x8272;&#x6A21;&#x5F0F;&#x9002;&#x914D;&#x592A;&#x5DEE;&#xFF0C;&#x5199;python&#x7528;&#x4E86;pycharm&#xFF0C;&#x6240;&#x4EE5;VS Code&#x5C31;&#x5F03;&#x4E86;
Typora - &#x4ED8;&#x8D39;&#x4E86;&#xFF0C;&#x6CA1;&#x94B1; 
Ulysses - &#x5B8C;&#x7F8E;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x662F;&#x5728;setapp for mac&#x8BA2;&#x9605;&#x91CC;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x8BA2;&#x9605;setapp for iOS&#xFF0C;&#x6240;&#x4EE5;&#x5728;iPad&#x548C;iPhone&#x4E0A;&#x6CA1;&#x6CD5;&#x513F;&#x7528;&#xFF0C;&#x5FCD;&#x75DB;&#x5272;&#x7231;
Bear - &#x597D;&#x4E45;&#x6CA1;&#x66F4;&#x65B0;&#xFF0C;&#x6CA1;&#x4F53;&#x9A8C;&#x51FA;&#x65B0;&#x610F;
&#x5C0F;&#x4E66;&#x5320; - &#x529F;&#x80FD;&#x597D;&#x591A;&#xFF0C;&#x754C;&#x9762;&#x4E00;&#x8A00;&#x96BE;&#x5C3D;
metion - markdown.app&#x4F5C;&#x8005;&#x505A;&#x7684;&#xFF0C;&#x4E3B;&#x6253;&#x4E2D;&#x6587;&#x73AF;&#x5883;&#x7684;markdown&#xFF0C;&#x4F46;&#x662F;Mac&#x7684;&#x754C;&#x9762;&#x6709;&#x4E9B;&#x7C97;&#x7CD9;&#xFF0C;&#x611F;&#x89C9;metion&#x7684;&#x91CD;&#x5FC3;&#x5728;iPadOS&#x4E86;&#xFF0C;&#x800C;&#x6211;&#x5BF9;iPad&#x7801;&#x5B57;&#x65E0;&#x611F;</p>
</blockquote>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x9009;&#x62E9;&#x4E86;&#x73B0;&#x5728;&#x975E;&#x5E38;&#x706B;&#x7684;&#x4E00;&#x6B3E;&#x2014;&#x2014;Obsidian&#x3002;</p>
<h3 id="obsidian">Obsidian</h3>
<p>Obsidian&#x662F;&#x4E00;&#x6B3E;&#x672C;&#x5730;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;&#xFF0C;&#x652F;&#x6301;Markdown&#x6587;&#x4EF6;&#xFF0C;Obsidian&#x6700;&#x5927;&#x7684;&#x7279;&#x70B9;&#x5C31;&#x662F;&#x81EA;&#x7531;&#x5EA6;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;Obsidian&#x53EA;&#x662F;&#x4E00;&#x5F20;&#x767D;&#x7EB8;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x521B;&#x9020;&#x51FA;&#x65E0;&#x9650;&#x7684;&#x53EF;&#x80FD;&#x3002;</p>
<ol>
<li>&#x4E3B;&#x9898;&#x4E30;&#x5BCC;
&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x201C;&#x989C;&#x63A7;&#x201D;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x7ECF;&#x5E38;&#x636F;&#x996C;&#x8F6F;&#x4EF6;&#x7684;&#x4E3B;&#x9898;&#x771F;&#x7684;&#x662F;&#x4E50;&#x8DA3;&#x65E0;&#x7A77;&#x3002;GitHub&#x4E0A;&#x6709;&#x5927;&#x91CF;&#x5927;&#x4F6C;&#x5199;&#x597D;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x9700;&#x8981;&#x5728;Obsidian&#x8F6F;&#x4EF6;&#x5185;&#x5373;&#x53EF;&#x66F4;&#x6362;&#x4E3B;&#x9898;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x4E2A;CSS&#x6587;&#x4EF6;&#x5BFC;&#x5165;Obsidian&#x3002;
<img src="https://heinrich-1304907654.cos.ap-beijing.myqcloud.com/uPic/CleanShot%202022-01-22%20at%2012.13.56%402x.png" alt="CleanShot2022-01-22at12.13.56@2x"></li>
</ol>
<p>&#x53E6;&#x5916;&#x5BF9;&#x4E8E;GitHub&#x4E0A;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x914D;&#x5408;Community Plugins&#x4E2D;&#x7684;Style Settings&#x8FDB;&#x884C;&#x4E2A;&#x6027;&#x5316;&#x8BBE;&#x7F6E;&#xFF0C;&#x4F8B;&#x5982;&#x6211;&#x5B89;&#x88C5;&#x7684;&#x662F;Yin and Yang Theme&#xFF0C;&#x5176;&#x9ED8;&#x8BA4;&#x7684;&#x914D;&#x8272;&#x4E3A;&#x7C89;&#x8272;&#xFF0C;&#x6211;&#x60F3;&#x6362;&#x6210;&#x84DD;&#x8272;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5728;Style Settings&#x63D2;&#x4EF6;&#x4E2D;&#x8FDB;&#x884C;&#x8BBE;&#x7F6E;&#x3002;
<img src="https://heinrich-1304907654.cos.ap-beijing.myqcloud.com/uPic/CleanShot%202022-01-22%20at%2012.22.08%402x.png" alt="CleanShot2022-01-22at12.22.08@2x"></p>
<ol>
<li>&#x63D2;&#x4EF6;&#x7CFB;&#x7EDF;
&#x76EE;&#x524D;Obsidian&#x7684;&#x793E;&#x533A;&#x6D3B;&#x8DC3;&#x5EA6;&#x5F88;&#x5927;&#xFF0C;&#x5F88;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x5728;&#x521B;&#x4F5C;&#x65B0;&#x7684;&#x63D2;&#x4EF6;&#xFF0C;Obsidian&#x5B98;&#x65B9;&#x4E5F;&#x5728;&#x4E0D;&#x65AD;&#x66F4;&#x65B0;&#xFF0C;&#x4E3A;&#x5927;&#x5BB6;&#x7684;&#x5F00;&#x53D1;&#x63D0;&#x4F9B;&#x4FBF;&#x5229;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x5B8C;&#x5584;&#x548C;&#x4E30;&#x5BCC;&#x8F6F;&#x4EF6;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x6211;&#x76EE;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x4E00;&#x4E9B;&#x63D2;&#x4EF6;&#xFF1A;</li>
</ol>
<table>
<thead>
<tr>
<th>&#x63D2;&#x4EF6;</th>
<th style="text-align:center">&#x529F;&#x80FD;</th>
</tr>
</thead>
<tbody>
<tr>
<td>Advanced Tables</td>
<td style="text-align:center">&#x9AD8;&#x7EA7;&#x8868;&#x683C;&#x5DE5;&#x5177;&#xFF0C;&#x7528;&#x64CD;&#x4F5C;Excel&#x7684;&#x903B;&#x8F91;&#x64CD;&#x4F5C;Markdown</td>
</tr>
<tr>
<td>Code Clock Enhancer</td>
<td style="text-align:center">&#x65B9;&#x4FBF;Markdown&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x5199;&#x4F5C;</td>
</tr>
<tr>
<td>Style Settings</td>
<td style="text-align:center">&#x914D;&#x5408;CSS&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x4E3B;&#x9898;&#x4E2A;&#x6027;&#x5316;&#x8BBE;&#x7F6E;</td>
</tr>
<tr>
<td>&#x76D8;&#x53E4;</td>
<td style="text-align:center">&#x5728;&#x4E2D;&#x6587;&#x548C;&#x82F1;&#x6587;&#x4E2D;&#x95F4;&#x6DFB;&#x52A0;&#x7A7A;&#x683C;&#xFF0C;&#x65B9;&#x4FBF;&#x6392;&#x7248;</td>
</tr>
</tbody>
</table>
<p>Obsidian&#x7684;&#x81EA;&#x7531;&#x5EA6;&#x8BA9;&#x4ED6;&#x4E5F;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x6B3E;&#x5F3A;&#x5927;&#x4F46;&#x96BE;&#x4E0A;&#x624B;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x6211;&#x5230;&#x73B0;&#x5728;&#x4E5F;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x529F;&#x80FD;&#x548C;&#x63D2;&#x4EF6;&#x6CA1;&#x6709;&#x6D89;&#x53CA;&#x5230;&#xFF0C;&#x4E4B;&#x540E;&#x53D1;&#x73B0;&#x65B0;&#x7684;&#x529F;&#x80FD;&#x518D;&#x4E0E;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x3002;</p>
<h2 id="3-&#x540C;&#x6B65;-sync">3. &#x540C;&#x6B65; Sync</h2>
<p>&#x53E6;&#x5916;Obsidian&#x7684;&#x53D1;&#x5E03;&#x548C;&#x540C;&#x6B65;&#x529F;&#x80FD;&#x9700;&#x8981;&#x8BA2;&#x9605;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x6682;&#x65F6;&#x5148;&#x4FDD;&#x5B58;&#x81F3;Evernote&#x8FDB;&#x884C;&#x591A;&#x5E73;&#x53F0;&#x540C;&#x6B65;&#x548C;&#x4E91;&#x7AEF;&#x5B58;&#x50A8;&#xFF0C;&#x4E4B;&#x540E;&#x53EF;&#x80FD;&#x4F1A;&#x5C1D;&#x8BD5;&#x7528;Git&#x8FDB;&#x884C;&#x540C;&#x6B65;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="输出.html" class="navigation navigation-next " aria-label="Next page: 输出">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"输入","level":"1.2","depth":1,"next":{"title":"输出","level":"1.3","depth":1,"path":"输出.md","ref":"输出.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"输入.md","mtime":"2022-01-22T05:30:09.705Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-01-27T04:08:44.912Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

